STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Unicast_Client/System/Config/LowPower/peripheral_init.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    peripheral_init.c
  * @author  MCD Application Team
  * @brief   tbd module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_conf.h"
#include "peripheral_init.h"
#include "main.h"
#include "crc_ctrl.h"
/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32wba55g_discovery.h"
/* USER CODE END Includes */

/* External variables --------------------------------------------------------*/
extern CRC_HandleTypeDef hcrc;
extern DMA_HandleTypeDef handle_GPDMA1_Channel2;
extern RAMCFG_HandleTypeDef hramcfg_SRAM1;
extern RAMCFG_HandleTypeDef hramcfg_SRAM2;
extern RNG_HandleTypeDef hrng;
extern DMA_HandleTypeDef handle_GPDMA1_Channel7;

/* USER CODE BEGIN EV */
#if (CFG_JOYSTICK_SUPPORTED == 1)
extern uint8_t JOY_StandbyExitFlag;
#endif /* CFG_JOYSTICK_SUPPORTED */
/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/

/**
  * @brief  Configure the SoC peripherals at Standby mode exit.
  * @param  None
  * @retval None
  */
void MX_StandbyExit_PeripharalInit(void)
{
  /* USER CODE BEGIN MX_STANDBY_EXIT_PERIPHERAL_INIT_1 */

  /* USER CODE END MX_STANDBY_EXIT_PERIPHERAL_INIT_1 */

  /* Select SysTick source clock */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_LSE);
  /* Re-Initialize Tick with new clock source */
  HAL_InitTick(TICK_INT_PRIORITY);

  memset(&hcrc, 0, sizeof(hcrc));
  memset(&handle_GPDMA1_Channel2, 0, sizeof(handle_GPDMA1_Channel2));
  memset(&hramcfg_SRAM1, 0, sizeof(hramcfg_SRAM1));
  memset(&hramcfg_SRAM2, 0, sizeof(hramcfg_SRAM2));
  memset(&hrng, 0, sizeof(hrng));
  memset(&handle_GPDMA1_Channel7, 0, sizeof(handle_GPDMA1_Channel7));

  MX_GPIO_Init();
  MX_RAMCFG_Init();
  MX_RNG_Init();
  MX_CRC_Init();
  MX_ICACHE_Init();
  CRCCTRL_Init();

#if (CFG_DEBUGGER_LEVEL == 0)
  GPIO_InitTypeDef DbgIOsInit = {0};
  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  __HAL_RCC_GPIOA_CLK_ENABLE();
  HAL_GPIO_Init(GPIOA, &DbgIOsInit);

  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_3|GPIO_PIN_4;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  HAL_GPIO_Init(GPIOB, &DbgIOsInit);
#endif /* CFG_DEBUGGER_LEVEL */
  /* USER CODE BEGIN MX_STANDBY_EXIT_PERIPHERAL_INIT_2 */
#if (CFG_JOYSTICK_SUPPORTED == 1)
  JOY_StandbyExitFlag = 1;
#endif /* CFG_JOYSTICK_SUPPORTED */
  /* USER CODE END MX_STANDBY_EXIT_PERIPHERAL_INIT_2 */
}
